Tekla Open API Reference for Tekla Structures 2025
PlacingAttributes Methods
The PlacingAttributes type exposes the following members.
Methods
Name | Description
Clone
 Creates a new object that is a copy of the current instance.
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
PlacingAttributes Class
Tekla.Structures.Drawing Namespace